Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
/**
 * @file uart.c
 * @brief Multi-Channel UART Driver for RX72N SCI Peripherals
 *
 * @details
 * ## Overview
 *
 * Production-quality UART driver for RX72N Serial Communication Interface (SCI)
 * peripherals. Provides synchronous TX and RX functionality across 13 SCI channels
 * (SCI0-SCI12) with configurable baud rates, automatic newline conversion, and
 * comprehensive error handling.
 *
 * ## Architecture
 *
 * @dot
 * digraph uart_architecture {
 *   rankdir=TB;
 *   node [shape=box, style=rounded];
 *
 *   subgraph cluster_app {
 *     label="Application Layer";
 *     style=filled;
 *     color=lightblue;
 *     debug_api [label="Debug Functions\nuart_debug_init/puts/putc"];
 *     channel_api [label="Channel Functions\nuart_init/putc/puts/getc_channel"];
 *   }
 *
 *   subgraph cluster_driver {
 *     label="Driver Layer";
 *     style=filled;
 *     color=lightyellow;
 *     internal [label="Internal Functions\ninternal_calculate_brr\ninternal_configure_uart_pins\ninternal_enable_sci_clock"];
 *     state [label="State Management\ns_channel_initialized[]"];
 *   }
 *
 *   subgraph cluster_hal {
 *     label="Hardware Abstraction";
 *     style=filled;
 *     color=lightgreen;
 *     sci_regs [label="SCI Registers\nSCR, SMR, BRR, TDR, RDR, SSR"];
 *     mpc [label="Pin Mux (MPC)\nrx_mpc_set_sci()"];
 *     gpio [label="GPIO Control\nPDR, PMR registers"];
 *   }
 *
 *   debug_api -> channel_api;
 *   channel_api -> internal;
 *   channel_api -> state;
 *   internal -> sci_regs;
 *   internal -> mpc;
 *   internal -> gpio;
 * }
 * @enddot
 *
 * ## Hardware Details
 *
 * @par Hardware Requirements:
 *
 * | Component | Requirement | Notes |
 * |-----------|-------------|-------|
 * | MCU | Renesas RX72N | SCI peripheral required |
 * | Channels | SCI0-SCI12 | 13 channels total |
 * | Clock | PCLKB (SCI0-6,12) / PCLKA (SCI7-11) | Per-channel BRR clock |
 * | TX Pin | Port pin configured as output | Requires MPC configuration |
 * | RX Pin | Port pin configured as input | Requires MPC configuration |
 * | USB Bridge | CY7C65213 (default) | For SCI9 debug channel |
 *
 * @par Default Debug Configuration (SCI9):
 *
 * | Parameter | Value | Notes |
 * |-----------|-------|-------|
 * | Channel | SCI9 | Connected to USB-UART bridge |
 * | TX Pin | PB7 (TXD9) | Output, peripheral mode |
 * | RX Pin | PB6 (RXD9) | Input, peripheral mode |
 * | Baud Rate | 115200 bps | Standard debug speed |
 * | Data Bits | 8 | Fixed |
 * | Parity | None | Fixed |
 * | Stop Bits | 1 | Fixed |
 *
 * ## Baud Rate Calculation
 *
 * The SCI baud rate formula for n=0 (CKS=00, PCLK/1):
 *
 * @f[
 *   \text{BRR} = \frac{\text{PCLK}}{32 \times B} - 1
 * @f]
 *
 * f_PCLK depends on the channel group (manual section 5 I/O register table):
 * - SCI0-SCI6, SCI12 (SCIj/SCIh): PCLKB
 * - SCI7-SCI11 (SCIi, extended 0x000D0xxx): PCLKA
 *
 * Note: the 01-system-clock audit is authoritative on actual PCLK frequencies;
 * empirical evidence suggests PCLKB = 120 MHz (not 60 MHz as in rx72n_clock.h).
 *
 * @par Supported Baud Rates (at PCLKB = 60 MHz, for SCI0-SCI6/SCI12):
 *
 * | Baud Rate | BRR | Actual Rate | Error |
 * |-----------|-----|-------------|-------|
 * | 9600 | 194 | 9615 | +0.16% |
 * | 19200 | 96 | 19231 | +0.16% |
 * | 38400 | 47 | 38462 | +0.16% |
 * | 57600 | 31 | 58594 | +1.73% |
 * | 115200 | 15 | 117188 | +1.73% |
 * | 230400 | 7 | 234375 | +1.73% |
 * | 460800 | 3 | 468750 | +1.73% |
 * | 921600 | 1 | 937500 | +1.73% |
 *
 * ## Performance Characteristics
 *
 * | Operation | Execution Time | Stack Usage | Notes |
 * |-----------|---------------|-------------|-------|
 * | uart_init_channel | ~50 us | 48 bytes | Includes MPC configuration |
 * | uart_putc_channel | ~90 us @ 115200 | 16 bytes | Includes wait for TDRE |
 * | uart_puts_channel | ~90 us/char | 24 bytes | With \n->\r\n conversion |
 * | uart_getc_channel | ~5 us | 16 bytes | Non-blocking if no data |
 * | uart_debug_init | ~50 us | 64 bytes | Wrapper for SCI9 |
 *
 * @par Memory Footprint:
 * - Code size: ~2 KB (all functions)
 * - Static data: 13 bytes (s_channel_initialized array)
 * - Stack usage: < 64 bytes (deepest call)
 * - Heap usage: 0 bytes (zero dynamic allocation)
 *
 * ## Thread Safety
 *
 * | Function | Thread Safe? | Notes |
 * |----------|--------------|-------|
 * | uart_init_channel | [FAIL] No | Call once per channel during init |
 * | uart_deinit_channel | [FAIL] No | Call once during shutdown |
 * | uart_putc_channel | [WARN] Partial | Safe if different channels |
 * | uart_puts_channel | [WARN] Partial | Safe if different channels |
 * | uart_getc_channel | [WARN] Partial | Safe if different channels |
 * | uart_debug_* | [WARN] Partial | All use same channel (SCI9) |
 *
 * **Note:** Multiple threads can safely use different UART channels simultaneously.
 * For shared channel access, use external mutex protection.
 *
 * @par Module Dependencies:
 *
 * **This module depends on:**
 * - `hardware.h` - Hardware configuration and channel constants
 * - `rx72n_clock.h` - PCLKB frequency definition
 * - `rx72n_regs.h` - SCI register definitions
 * - `rx_mpc.h` - Pin mux configuration
 * - `rx_port_utils.h` - GPIO port utilities
 * - `rx_register_protection.h` - PRCR register protection
 *
 * **This module is used by:**
 * - `rx_log.c` - Logging subsystem output
 * - `main.c` - Debug output during initialization
 * - `comm_task.c` - Communication task debug messages
 *
 * @par NASA Power of 10 Compliance:
 *
 * | Rule | Status | Implementation |
 * |------|--------|----------------|
 * | 1. Simple control flow | [OK] | No goto/setjmp/recursion |
 * | 2. Fixed loop bounds | [OK] | All loops use k_uart_max_str_len limit |
 * | 3. No dynamic allocation | [OK] | Zero malloc/free, static buffers only |
 * | 4. Small functions | [OK] | All functions < 60 lines |
 * | 5. Assertions (>=2/func) | [OK] | Parameter validation + state checks |
 * | 6. Narrow scope | [OK] | Static file-scope state, local variables |
 * | 7. Check return values | [OK] | All rx_err_t returns propagated |
 * | 8. Limited preprocessor | [OK] | C23 typed enums only |
 * | 9. Pointer restrictions | [OK] | Single-level pointers, no arithmetic |
 * | 10. Compiler warnings | [OK] | -Wall -Wextra -Werror clean |
 *
 * @par SOLID Principles:
 *
 * **Single Responsibility (S):**
 * - This module handles ONLY UART communication
 * - Separate from higher-level logging (rx_log.c)
 * - Separate from protocol parsing (rx_frame.c)
 *
 * **Open/Closed (O):**
 * - New baud rates supported without code changes
 * - New channels added via configuration structure
 * - Pin assignments configurable per-channel
 *
 * **Liskov Substitution (L):**
 * - All channel functions accept any valid channel
 * - Consistent rx_err_t return semantics
 * - Debug functions are simple wrappers
 *
 * **Interface Segregation (I):**
 * - Separate init/deinit from TX/RX operations
 * - Debug functions provide simplified interface
 * - Channel functions provide full control
 *
 * **Dependency Inversion (D):**
 * - Uses abstract rx_port_pin_t for pin specification
 * - Uses rx_mpc module for pin configuration
 * - Uses rx_err_t for standardized error handling
 *
 * @see hardware.h Hardware configuration and constants
 * @see rx72n_sci_regs.h SCI register definitions
 * @see rx_mpc.h Pin mux configuration API
 * @see rx_log.h Higher-level logging that uses this driver
 *
 * @author Locked, Inc.
 * @date 2026-01-28
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 * @since Version 1.0.0
 */

#ifdef __RX__

#include <stdint.h>

#include "hardware.h"
#include "rx72n_clock.h"
#include "rx72n_icu_regs.h" /* icu() for SCI9_RXI9 interrupt enable */
#include "rx72n_regs.h"
#include "rx_mpc.h"
#include "rx_port_utils.h"
#include "rx_register_protection.h"
#include "rx_simulator_config.h" /* For RX_IS_SIMULATOR conditional compilation */

