Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
/** @brief UART timeout constants */
typedef enum : uint32_t {
  k_uart_tx_timeout        = 100000, /**< Transmit buffer wait timeout (prevents infinite loop) */
  k_uart_timeout_expired   = 0,      /**< Timeout counter expired value */
  k_uart_timeout_decrement = 1,      /**< Timeout counter decrement value */
} uart_timeout_t;

/** @brief UART flag comparison constants */
typedef enum : uint8_t {
  k_uart_flag_clear = 0, /**< Flag bit is not set (comparison result) */
} uart_flag_constants_t;

/** @brief UART buffer and string size limits */
typedef enum : uint32_t {
  k_uart_max_str_len = 256, /**< Maximum string length for uart_puts_channel */
} uart_buffer_constants_t;

/**
 * @brief SCI module stop bit positions in MSTPCRB
 *
 * SCI0-SCI7 occupy contiguous bits 31-24 (MSTPB31 down to MSTPB24).
 * SCI12 (SCIh module) is a non-contiguous outlier at MSTPB4.
 * SCI8-SCI11 live in MSTPCRC, not here -- see sci_mstpc_bits_t.
 *
 * Manual: section 11.2.3 MSTPCRB, page 408.
 */
typedef enum : uint8_t {
  k_sci_mstpb_sci0  = 31, /**< SCI0 module stop bit in MSTPCRB (MSTPB31) */
  k_sci_mstpb_sci1  = 30, /**< SCI1 module stop bit in MSTPCRB (MSTPB30) */
  k_sci_mstpb_sci2  = 29, /**< SCI2 module stop bit in MSTPCRB (MSTPB29) */
  k_sci_mstpb_sci3  = 28, /**< SCI3 module stop bit in MSTPCRB (MSTPB28) */
  k_sci_mstpb_sci4  = 27, /**< SCI4 module stop bit in MSTPCRB (MSTPB27) */
  k_sci_mstpb_sci5  = 26, /**< SCI5 module stop bit in MSTPCRB (MSTPB26) */
  k_sci_mstpb_sci6  = 25, /**< SCI6 module stop bit in MSTPCRB (MSTPB25) */
  k_sci_mstpb_sci7  = 24, /**< SCI7 module stop bit in MSTPCRB (MSTPB24) */
  k_sci_mstpb_sci12 = 4,  /**< SCI12 (SCIh) module stop bit in MSTPCRB (MSTPB4) */
} sci_mstpb_bits_t;

/**
 * @brief SCI module stop bit positions in MSTPCRC
 *
 * SCI8-SCI11 (SCIi module, extended peripheral region 0x000D0000) are
 * controlled by MSTPCRC, NOT MSTPCRB.  Clearing the corresponding bit
 * releases the channel from the module-stop state.
 *
 * Manual: section 11.2.4 MSTPCRC, page 410.
 */
typedef enum : uint8_t {
  k_sci_mstpc_sci8  = 27, /**< SCI8 module stop bit in MSTPCRC (MSTPC27) */
  k_sci_mstpc_sci9  = 26, /**< SCI9 module stop bit in MSTPCRC (MSTPC26) */
  k_sci_mstpc_sci10 = 25, /**< SCI10 module stop bit in MSTPCRC (MSTPC25) */
  k_sci_mstpc_sci11 = 24, /**< SCI11 module stop bit in MSTPCRC (MSTPC24) */
} sci_mstpc_bits_t;

/** @brief Debug UART pins (SCI9 on RX72N) */
typedef enum : uint16_t {
  k_uart_debug_tx_gpio = k_rx_pb_7, /**< PB7 = TXD9 */
  k_uart_debug_rx_gpio = k_rx_pb_6, /**< PB6 = RXD9 */
} uart_debug_pins_t;

/**
 * @enum uart_gpio_constants_t
 * @brief GPIO register bit manipulation constants for UART pin configuration
 *
 * @details
 * Provides the single-bit seed value used when constructing per-pin bitmasks
 * for the PDR (Port Direction Register) and PMR (Port Mode Register) during
 * UART TX/RX pin setup.  A bit mask for a specific pin is formed by shifting
 * this value left by the pin index obtained from rx_pin_from_pin().
 *
 * @invariant k_uart_gpio_bit_set must equal 1 so that left-shifting by a pin
 * index produces an isolated single-bit mask.
 *
 * @par Example:
 * @code{.c}
 * // Build the TX pin mask and set the direction bit
 * const uint8_t tx_pin      = rx_pin_from_pin(tx_gpio);
 * const uint8_t tx_pin_mask = (uint8_t)(k_uart_gpio_bit_set << tx_pin);
 * tx_port_base->pdr |= tx_pin_mask;  // Set output direction
 * tx_port_base->pmr |= tx_pin_mask;  // Switch to peripheral mode
 * @endcode
 *
 * @see internal_configure_uart_pins() Only consumer of this constant
 * @see uart_init_channel() Top-level function that triggers pin configuration
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_uart_gpio_bit_set = 1, /**< Seed value for constructing a single-pin bitmask via left-shift */
} uart_gpio_constants_t;

/* =============================================================================
 * Private State
 * =============================================================================
 */

/** @brief Per-channel initialization state */
static bool s_channel_initialized[k_uart_array_size] = {false};

/* =============================================================================
 * Interrupt-driven RX ring buffer for SCI9
 * =============================================================================
 *
 * SCI9 on the RX72N has no hardware RX FIFO. Polling RDRF in a 10 ms task
 * loop (rx_comm_manager's 100 Hz cadence) catches roughly 1 byte per poll
 * while the gateway can send ~115 bytes / 10 ms at 115200 baud. Any byte
 * arriving while RDRF is still set from the previous byte triggers an
 * overrun (SSR.ORER) and is lost.
 *
 * Fix: enable the SCI9_RXI9 interrupt (vector 102) and copy every byte
 * into a lock-free single-producer / single-consumer ring buffer as it
 * arrives. uart_getc_channel (and uart_rx_available) for SCI9 then reads
 * from the ring instead of polling RDR directly. HUM section 34.2.8
 * describes the RXI request behavior.
 */
typedef enum : uint16_t {
  k_sci9_rx_ring_size = 512U, /**< Power-of-2 mask-friendly size; covers 4.4 ms of 115200-baud traffic */
  k_sci9_rx_ring_mask = k_sci9_rx_ring_size - 1U,
  k_sci_scr_rie_bit   = 0x40U, /**< SCR.RIE: receive interrupt enable, HUM 34.2.5 */
} sci9_rx_ring_consts_t;

static volatile uint8_t  s_sci9_rx_ring[k_sci9_rx_ring_size];
static volatile uint16_t s_sci9_rx_head = 0U; /**< ISR writes here, task reads */
static volatile uint16_t s_sci9_rx_tail = 0U; /**< Task reads here, ISR never touches */
static volatile uint32_t s_sci9_rx_drops = 0U; /**< Ring-full byte drops (diagnostic) */

/* =============================================================================
 * Private Functions
 * =============================================================================
 */

/**
 * @brief Calculate the 8-bit BRR register value for a target baud rate
 *
 * @details
 * Computes the value to be written to the SCI Bit Rate Register (BRR) so that
 * the SCI peripheral generates the requested baud rate from PCLKB.  The
 * general RX72N SCI baud rate formula for asynchronous mode is:
 *
 * @f[
 *   \text{BRR} = \frac{\text{PCLKB}}{64 \times 2^{2n-1} \times B} - 1
 * @f]
 *
 * This driver always uses n=0 (CKS bits = 0b00, clock source = PCLK/1), which
 * simplifies to:
 *
 * @f[
 *   \text{BRR} = \frac{\text{PCLK}}{32 \times B} - 1
 * @f]
 *
 * The caller supplies the correct PCLK frequency for the target channel:
 * - SCI0-SCI6, SCI12 (SCIj/SCIh, standard region): use k_pclkb_hz
 * - SCI7-SCI11 (SCIi, extended region 0x000D0xxx):  use k_pclka_hz
 *
 * This distinction matters when PCLKA != PCLKB.  The 01-system-clock audit
 * is authoritative on actual PCLK frequencies; empirical evidence suggests
 * PCLKB = 120 MHz, not 60 MHz as documented in rx72n_clock.h.
 *
 * **Algorithm steps:**
 * 1. Guard against baudrate == 0 (return k_brr_max_value as a safe sentinel).
 * 2. Guard against baudrate > pclk_hz/32 (return k_brr_min_value).
 * 3. Compute divisor_result = pclk_hz / (32 * B) using integer arithmetic.
 * 4. Guard against divisor_result <= 1 to prevent underflow from the -1 offset.
 * 5. Compute BRR = divisor_result - 1.
 * 6. Clamp the result to k_brr_max_value (255) if the integer exceeds the
 *    8-bit range (indicates a baud rate too slow for this clock).
 * 7. Return the clamped 8-bit result.
 *
 * @param[in] baudrate Target baud rate in bps
 *   - **Valid range**: 1 to pclk_hz/k_brr_divisor_n0
 *   - **Special case**: 0 returns k_brr_max_value (255) as a safe sentinel
 *   - **Units**: bits per second
 * @param[in] pclk_hz Peripheral clock driving this SCI channel (Hz)
 *   - **SCI0-SCI6, SCI12**: k_pclkb_hz
 *   - **SCI7-SCI11**:       k_pclka_hz
 *
 * @return uint8_t BRR register value to program into sci->brr
 * @retval 0..254 Computed BRR for the requested baud rate
 * @retval 0 (k_brr_min_value) Returned when baudrate > pclk_hz/32 or underflow
 * @retval 255 (k_brr_max_value) Returned when baudrate == 0 or BRR > 255
 *
 * @pre baudrate validated by caller; pclk_hz must be non-zero
 * @pre k_brr_divisor_n0 must be non-zero compile-time constant
 *
 * @post Return value is always in [0, 255]
 * @post Caller must write the returned value to sci->brr before enabling TX/RX
 *
 * @note Stateless pure function; safe to call from any context including ISR
 * @note Always uses n=0 (CKS=00); support for n=1..3 is not implemented
 *
 * @par Example:
 * @code{.c}
 * // SCI9 uses PCLKA (SCIi extended region)
 * sci->brr = internal_calculate_brr(921600U, k_pclka_hz);
 * @endcode
 *
 * @see uart_init_channel() Caller that selects pclk_hz and writes sci->brr
 * @see brr_constants_t Constants used in the BRR formula
 *
 * @since Version 1.0.0
 */
static uint8_t internal_calculate_brr(const uint32_t baudrate, const uint32_t pclk_hz)
{
  /* Pre-condition: reject zero baudrate (division by zero) */
  if (baudrate == 0) {
    return k_brr_max_value;
  }

  /* Pre-condition: reject baudrate above maximum for this clock */
  if (baudrate > (pclk_hz / k_brr_divisor_n0)) {
    return k_brr_min_value;
  }

  /* For n=0 (CKS=00): BRR = (PCLK / (32 * B)) - 1 */
  const uint32_t divisor_result = pclk_hz / (k_brr_divisor_n0 * baudrate);

  /* Guard against underflow: if divisor_result is 0, subtraction would wrap */
  if (divisor_result <= k_brr_formula_offset) {
    return k_brr_min_value;
  }

  const uint32_t brr_value = divisor_result - k_brr_formula_offset;

  /* Clamp to maximum BRR register value */
  if (brr_value > k_brr_max_value) {
    return k_brr_max_value;
  }

  const uint8_t result = (uint8_t)brr_value;

  return result;
}

/**
 * @brief Clear receive error flags in the SCI Serial Status Register (SSR)
 *
 * @details
 * Reads the SSR register and writes it back with the three receive error flag
 * bits masked out, which clears any pending ORER (Overrun Error), FER
 * (Framing Error), and PER (Parity Error) conditions on the SCI channel.
 *
 * The RX72N SCI peripheral requires a read-modify-write sequence to clear
 * error flags: the hardware only allows clearing a flag by writing 0 to it
 * while keeping the rest of the register unchanged.  Writing 1 to an already-
 * set flag has no effect (the write is ignored).
 *
 * **Algorithm steps:**
 * 1. Guard: return immediately if sci is nullptr (NASA Power of 10 Rule 5).
 * 2. Read the current value of sci->ssr into a local volatile variable.
 * 3. Cast-to-void the read result to suppress the unused-variable warning while
 *    still ensuring the volatile read is not optimised away.
 * 4. Write sci->ssr = (ssr & ~k_sci_ssr_error_mask) to clear bits [5:3]
 *    (ORER, FER, PER) while preserving all other SSR bits.
 *
 * **Error flag bit positions in SSR:**
 * | Bit | Flag | Description |
 * |-----|------|-------------|
 * |  5  | ORER | Overrun Error - new data arrived before previous data was read |
 * |  4  | FER  | Framing Error - no valid stop bit detected |
 * |  3  | PER  | Parity Error  - parity mismatch (unused in 8N1 mode) |
 *
 * @param[in] sci Pointer to the SCI register block for the target channel
 *   - **Valid range**: Non-nullptr pointer obtained from sci_get_channel()
 *   - **Null handling**: Returns silently if nullptr (no-op; no error return)
 *
 * @pre sci must point to a valid, hardware-mapped rx_sci_regs_t register block
 * @pre The SCI module clock must be enabled (MSTPCRB bit cleared) before
 *      any SSR access; undefined behaviour otherwise
 *
 * @post ORER, FER, and PER bits in sci->ssr are cleared (written to 0)
 * @post All other SSR bits (TDRE, RDRF, TEND, MPB, MPBT) are preserved
 *
 * @note This function is intentionally void-returning; the caller (uart_getc_channel)
 *       checks for errors before calling and does not need a return code
 * @note The intermediate volatile read prevents the compiler from merging the
 *       read and write into a single store, which would miss the read requirement
 *
 * @par Thread Safety:
 * Not thread-safe. SSR is a read-modify-write target; concurrent access from
 * two threads on the same channel can corrupt flag state.  External mutex
 * protection is required if multiple threads share a channel.
 *
 * @par Performance:
 * - Execution time: ~3 cycles (volatile read + mask + volatile write)
 * - Stack usage: 4 bytes (one volatile uint8_t local)
 *
 * @par Example:
 * @code{.c}
 * volatile rx_sci_regs_t* sci = sci_get_channel(k_uart_channel_9);
 * if (sci != nullptr) {
 *   // Clear any stale error flags before reading receive data
 *   internal_clear_errors(sci);
 *   const char data = (char)sci->rdr;
 * }
 * @endcode
 *
 * @see uart_getc_channel() Caller that invokes this before reading RDR
 * @see sci_register_values_t k_sci_ssr_error_mask bitmask definition
 * @see uart_rx_available() Non-destructive receive availability check
 *
 * @since Version 1.0.0
 */
static void internal_clear_errors(volatile rx_sci_regs_t* sci)
{
  /* Pre-condition: Validate pointer (NASA Power of 10 Rule 5) */
  if (sci == nullptr) {
    return;
  }

  volatile uint8_t ssr = 0;

  /* Read SSR then clear error flags */
  ssr = sci->ssr;
  (void)ssr; /* Suppress unused variable warning */
  sci->ssr = (uint8_t)(ssr & ~k_sci_ssr_error_mask);
}

/**
 * @brief Return the MSTPCRB bit position for a channel, or -1 for MSTPCRC channels
 *
 * @details
 * Per manual section 11.2.3/11.2.4:
 * - SCI0-SCI7: MSTPCRB bits 31-24 (contiguous, descending)
 * - SCI8-SCI11: MSTPCRC bits 27-24 -- returns -1, caller uses MSTPCRC
 * - SCI12 (SCIh): MSTPCRB bit 4 (non-contiguous outlier)
 *
 * **Bit position table:**
 * | Channel | Register | Bit | Enum constant      |
 * |---------|----------|-----|--------------------|
 * | SCI0    | MSTPCRB  | 31  | k_sci_mstpb_sci0   |
 * | SCI1    | MSTPCRB  | 30  | k_sci_mstpb_sci1   |
 * | ...     | MSTPCRB  | ... | ...                |
 * | SCI7    | MSTPCRB  | 24  | k_sci_mstpb_sci7   |
 * | SCI8    | MSTPCRC  | 27  | (returns -1)       |
 * | SCI9    | MSTPCRC  | 26  | (returns -1)       |
 * | SCI10   | MSTPCRC  | 25  | (returns -1)       |
 * | SCI11   | MSTPCRC  | 24  | (returns -1)       |
 * | SCI12   | MSTPCRB  |  4  | k_sci_mstpb_sci12  |
 *
 * @param[in] channel SCI channel index (0-12, validated by caller)
 *
 * @return int8_t MSTPCRB bit index, or -1 for MSTPCRC channels (8-11)
 * @retval 4        Channel 12 (SCI12, MSTPCRB bit 4)
 * @retval 24..31   Channels 0-7 (MSTPCRB bits 31-24)
 * @retval -1       Channels 8-11 (caller must use MSTPCRC)
 *
 * @pre k_sci_mstpb_sci0 == 31 for the descending formula to be correct
 * @post If return >= 0, it is a valid MSTPCRB bit index
 *
 * @note int8_t so -1 fits without consuming a valid bit position
 *
 * @since Version 1.0.0
 */
static int8_t internal_get_mstpb_bit(const uint8_t channel)
{
  if (channel <= k_uart_max_mstpb_channel) {
    /* SCI0-SCI7: MSTPCRB bits 31-24, descending */
    return (int8_t)(k_sci_mstpb_sci0 - channel);
  }
  if (channel > k_uart_mstpc_channel_max) {
    /* SCI12 (SCIh): MSTPCRB bit 4 -- only remaining valid channel above 11 */
    return (int8_t)k_sci_mstpb_sci12;
  }
  /* SCI8-SCI11: live in MSTPCRC, not MSTPCRB */
  return -1;
}

/**
 * @brief Enable the peripheral clock for an SCI channel
 *
 * @details
 * Clears the module-stop bit for the given SCI channel so its clock runs.
 * Different channel groups use different control registers (manual 11.2.3/11.2.4):
 *
 * | Channels  | Register | Bits    |
 * |-----------|----------|---------|
 * | SCI0-SCI7 | MSTPCRB  | 31-24   |
 * | SCI8-SCI11| MSTPCRC  | 27-24   |
 * | SCI12     | MSTPCRB  | 4       |
 *
 * Both MSTPCRB and MSTPCRC are PRCR-protected; this function performs the
 * required unlock/modify/lock sequence for whichever register applies.
 *
 * @param[in] channel SCI channel index (0-12, validated by caller)
 *
 * @return rx_err_t
 * @retval k_rx_ok         Clock enabled successfully
 * @retval k_rx_err_invalid_arg  channel out of [0, k_uart_max_channels)
 *
 * @pre channel validated by uart_init_channel() to be in [0, 12]
 * @pre PRCR not already unlocked by another context
 *
 * @post Module-stop bit cleared; SCI clock gate open
 * @post PRCR returned to locked state
 *
 * @warning Not thread-safe; unlock/modify/lock must be atomic
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_enable_sci_clock(const uint8_t channel)
{
  const int8_t mstpb_bit = internal_get_mstpb_bit(channel);

  *prcr_reg() = k_rx_prcr_unlock_all;

  if (mstpb_bit >= 0) {
    /* SCI0-SCI7 and SCI12: clear bit in MSTPCRB */
    system_regs()->mstpcrb &= ~(k_uart_mstpcrb_bit_set << (uint8_t)mstpb_bit);
  } else if (channel >= k_uart_mstpc_channel_min && channel <= k_uart_mstpc_channel_max) {
    /* SCI8-SCI11: clear bit in MSTPCRC (bits 27-24) */
    const uint8_t mstpc_bit = (uint8_t)(k_sci_mstpc_sci8 - (channel - k_uart_mstpc_channel_min));
    system_regs()->mstpcrc &= ~(k_uart_mstpcrb_bit_set << mstpc_bit);
  } else {
    *prcr_reg() = k_rx_prcr_lock;
    return k_rx_err_invalid_arg;
  }

