Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
  return k_rx_ok;
}

/* =============================================================================
 * Multi-Channel UART Functions
 * =============================================================================
 */

/**
 * @brief Initialize UART channel with specified configuration
 *
 * @details
 * Configures and enables an SCI peripheral for asynchronous UART operation.
 * Handles module clock enable, pin mux configuration, and SCI register setup.
 *
 * **Algorithm steps:**
 * 1. Validate configuration parameters (NULL check, channel range, baud rate)
 * 2. Get SCI register base address for channel
 * 3. Check if channel is already initialized (prevent double-init)
 * 4. Enable SCI module clock (clear MSTPB bit)
 * 5. Configure TX/RX pins via MPC and GPIO registers
 * 6. Disable TX/RX during configuration (SCR = 0)
 * 7. Set serial mode: async, 8N1, PCLK/1 (SMR)
 * 8. Calculate and set baud rate divisor (BRR)
 * 9. Wait for 1 bit time (synchronization)
 * 10. Enable TX and RX (SCR = 0x30)
 * 11. Mark channel as initialized
 *
 * @dot
 * digraph uart_init {
 *   rankdir=TB;
 *   node [shape=box, style=rounded];
 *
 *   start [label="Start"];
 *   validate [label="Validate config"];
 *   check_init [label="Already initialized?", shape=diamond];
 *   enable_clk [label="Enable SCI clock"];
 *   config_pins [label="Configure TX/RX pins"];
 *   disable_txrx [label="Disable TX/RX"];
 *   set_mode [label="Set async 8N1 mode"];
 *   set_baud [label="Set BRR for baud rate"];
 *   wait [label="Wait 1 bit time"];
 *   enable_txrx [label="Enable TX + RX"];
 *   mark_init [label="Mark initialized"];
 *   success [label="Return k_rx_ok", fillcolor=lightgreen, style="rounded,filled"];
 *   error [label="Return error", fillcolor=lightcoral, style="rounded,filled"];
 *
 *   start -> validate;
 *   validate -> error [label="invalid"];
 *   validate -> check_init [label="valid"];
 *   check_init -> error [label="yes"];
 *   check_init -> enable_clk [label="no"];
 *   enable_clk -> config_pins;
 *   config_pins -> error [label="fail"];
 *   config_pins -> disable_txrx [label="ok"];
 *   disable_txrx -> set_mode;
 *   set_mode -> set_baud;
 *   set_baud -> wait;
 *   wait -> enable_txrx;
 *   enable_txrx -> mark_init;
 *   mark_init -> success;
 * }
 * @enddot
 *
 * @param[in] config Pointer to channel configuration structure.
 *   - **channel**: SCI channel (0-12)
 *   - **baudrate**: Target baud rate (1 to PCLKB/32)
 *   - **tx_gpio**: TX pin (rx_port_pin_t)
 *   - **rx_gpio**: RX pin (rx_port_pin_t)
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success, channel initialized and ready
 * @retval k_rx_err_null_ptr config parameter is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel (>=13) or invalid baud rate
 * @retval k_rx_err_invalid_state Channel already initialized
 *
 * @pre config must point to valid uart_channel_config_t structure
 * @pre config->channel must be in range [0, 12]
 * @pre config->baudrate must be in valid range for PCLKB
 * @pre Channel must not be already initialized
 *
 * @post Channel configured for 8N1 async operation
 * @post TX and RX enabled and ready for use
 * @post s_channel_initialized[channel] set to true
 * @post TX/RX pins configured for peripheral function
 *
 * @note Not thread-safe - call once during initialization
 * @note Includes ~1ms delay for baud rate synchronization
 * @warning Does not validate pin assignments against hardware
 *
 * @par Thread Safety:
 * Not thread-safe. Call once per channel during system initialization.
 *
 * @par Performance:
 * - Execution time: ~50 us (includes MPC and delay)
 * - Stack usage: 48 bytes
 *
 * @par Example:
 * @code{.c}
 * const uart_channel_config_t config = {
 *   .channel  = k_uart_channel_9,
 *   .baudrate = 115200,
 *   .tx_gpio  = k_rx_pb_7,
 *   .rx_gpio  = k_rx_pb_6,
 * };
 *
 * rx_err_t err = uart_init_channel(&config);
 * if (err != k_rx_ok) {
 *   // Handle error
 * }
 * @endcode
 *
 * @see uart_deinit_channel() Deinitialize channel
 * @see uart_putc_channel() Transmit single character
 * @see uart_channel_config_t Configuration structure
 *
 * @since Version 1.0.0
 */
rx_err_t uart_init_channel(const uart_channel_config_t* config)
{
  /* Validate config pointer */
  if (config == nullptr) {
    return k_rx_err_null_ptr;
  }

  /* Validate channel */
  if ((uint8_t)config->channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  if ((config->baudrate < k_uart_baudrate_min) || (config->baudrate > k_uart_baudrate_max)) {
    return k_rx_err_invalid_arg;
  }

  /* Get SCI register base */
  volatile rx_sci_regs_t* sci = sci_get_channel(config->channel);
  if (sci == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Check if already initialized */
  if (s_channel_initialized[config->channel]) {
    return k_rx_err_invalid_state;
  }

  /* Enable SCI module clock (clear module stop bit) */
  rx_err_t err = internal_enable_sci_clock(config->channel);
  if (err != k_rx_ok) {
    return err;
  }

  /* Configure TX/RX pins (MPC and GPIO) */
  err = internal_configure_uart_pins(config->tx_gpio, config->rx_gpio);
  if (err != k_rx_ok) {
    return err;
  }

  /* Disable TX/RX */
  sci->scr = k_sci_scr_disabled;

  /* Configure serial mode: Async, 8-bit, no parity, 1 stop, PCLK/1 */
  sci->smr = k_sci_smr_async_8n1;

  /* Select the correct peripheral clock for this channel.
   * SCIj (SCI0-SCI6) and SCIh (SCI12) are clocked by PCLKB.
   * SCIi (SCI7-SCI11, extended region 0x000D0xxx) are clocked by PCLKA.
   * Using the wrong clock produces a wrong BRR and a wrong baud rate. */
  const uint32_t pclk_hz = (((uint8_t)config->channel >= k_uart_pclka_channel_min) &&
                            ((uint8_t)config->channel <= k_uart_pclka_channel_max))
                             ? k_pclka_hz
                             : k_pclkb_hz;

  /* Set baud rate */
  sci->brr = internal_calculate_brr(config->baudrate, pclk_hz);

  /* Wait for at least 1 bit time */
  /* NOTE: Busy-wait required - may run before ThreadX initialization */
  for (volatile uint32_t i = 0; i < k_uart_bit_time_delay_cycles; i++) {
    __asm__ volatile("nop");
  }

  /* Configure serial control: Enable TX and RX */
  sci->scr = k_sci_scr_txrx_enabled;

  /* Configure serial extended mode */
  sci->semr = k_sci_semr_default;

