Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
  /* For SCI9, switch RX to interrupt-driven mode: reset the ring buffer,
   * set the RXI9 priority + IER bit + clear pending IR, then arm SCR.RIE.
   * HUM vector 102 = SCI9_RXI9, IER index 12 ((102>>3)=12), IER bit 6
   * ((102&7)=6). See comm_task RX overrun note at the top of this file. */
  if (config->channel == k_uart_channel_9) {
    s_sci9_rx_head = 0U;
    s_sci9_rx_tail = 0U;
    s_sci9_rx_drops = 0U;

    const uint16_t vec_rxi9  = 102U;
    icu()->ipr[vec_rxi9]     = 3U; /* Priority 3: lower than motor ctrl, higher than CMT tick */
    icu()->ir[vec_rxi9]      = 0U;
    icu()->ier[vec_rxi9 / 8U] |= (uint8_t)(1U << (vec_rxi9 % 8U));

    sci->scr = (uint8_t)(k_sci_scr_txrx_enabled | k_sci_scr_rie_bit);
  }

  /* Mark channel as initialized */
  s_channel_initialized[config->channel] = true;

  return k_rx_ok;
}

/**
 * @brief Deinitialize UART channel and disable TX/RX
 *
 * @details
 * Disables transmit and receive on the specified SCI channel and marks it
 * as uninitialized. The module clock is left running (safe to re-initialize
 * without re-enabling). After this call the channel may be re-initialized
 * with uart_init_channel().
 *
 * **Algorithm steps:**
 * 1. Validate channel number (0-12)
 * 2. Get SCI register base address
 * 3. Write SCR = 0 to disable TX and RX
 * 4. Clear s_channel_initialized[channel]
 *
 * @param[in] channel UART channel to deinitialize (0-12)
 *   - **Valid range**: 0 to 12 (SCI0 through SCI12)
 *   - **Recommended**: Use k_uart_channel_X constants
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success, channel TX/RX disabled
 * @retval k_rx_err_invalid_arg Invalid channel number (>=13) or invalid register pointer
 *
 * @pre channel must be in range [0, 12]
 * @pre Channel should be initialized before deinitializing (safe to call on uninit channel)
 *
 * @post TX and RX disabled (SCR = 0)
 * @post s_channel_initialized[channel] set to false
 *
 * @note Not thread-safe - call during shutdown, not during normal operation
 * @note Module stop clock is NOT re-asserted (peripheral clock left enabled)
 *
 * @par Thread Safety:
 * Not thread-safe. Do not call while another thread is using the channel.
 *
 * @par Performance:
 * - Execution time: ~1 us
 * - Stack usage: 16 bytes
 *
 * @par Example:
 * @code{.c}
 * rx_err_t err = uart_deinit_channel(k_uart_channel_9);
 * if (err != k_rx_ok) {
 *   // Handle error (invalid channel)
 * }
 * // Channel is now disabled and can be re-initialized
 * @endcode
 *
 * @see uart_init_channel() Initialize channel
 * @see uart_debug_init() Initialize debug channel (SCI9)
 *
 * @since Version 1.0.0
 */
rx_err_t uart_deinit_channel(const uart_channel_t channel)
{
  /* Validate channel */
  if ((uint8_t)channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  /* Get SCI register base */
  volatile rx_sci_regs_t* sci = sci_get_channel(channel);
  if (sci == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Disable TX/RX (this also drops SCR.RIE for SCI9). */
  sci->scr = k_sci_scr_disabled;

  /* For SCI9, mask the RXI9 interrupt in the ICU and flush the ring so a
   * subsequent re-init starts clean. */
  if (channel == k_uart_channel_9) {
    const uint16_t vec_rxi9 = 102U;
    icu()->ier[vec_rxi9 / 8U] &= (uint8_t) ~(1U << (vec_rxi9 % 8U));
    icu()->ir[vec_rxi9] = 0U;
    s_sci9_rx_head      = 0U;
    s_sci9_rx_tail      = 0U;
  }

  /* Mark channel as not initialized */
  s_channel_initialized[channel] = false;

  return k_rx_ok;
}

/**
 * @brief Transmit single character on UART channel
 *
 * @details
 * Transmits a single byte on the specified SCI channel. Waits for the transmit
 * data register to become empty (TDRE flag) with timeout protection, then writes
 * the data to TDR. Uses polling mode (no interrupts).
 *
 * **Algorithm steps:**
 * 1. Validate channel number (0-12)
 * 2. Check channel is initialized
 * 3. Get SCI register base address
 * 4. Wait for TDRE flag with timeout (k_uart_tx_timeout iterations)
 * 5. Write data byte to TDR register
 * 6. Clear TDRE flag (read SSR, write back with TDRE=0)
 *
 * **Character transmission timing at 115200 baud:**
 * - Start bit: 8.68 us
 * - 8 data bits: 69.44 us
 * - Stop bit: 8.68 us
 * - **Total**: ~86.8 us per character
 *
 * @param[in] channel UART channel to use (0-12)
 *   - **Valid range**: 0 to 12 (SCI0 through SCI12)
 *   - **Recommended**: Use k_uart_channel_X constants
 *
 * @param[in] data Character to transmit
 *   - **Valid range**: 0x00 to 0xFF (any byte value)
 *   - **Special handling**: '\n' not converted (use uart_puts_channel for conversion)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success, character transmitted
 * @retval k_rx_err_invalid_arg Invalid channel number (>=13)
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_timeout Transmit buffer did not become empty within timeout
 *
 * @pre Channel must be initialized via uart_init_channel()
 * @pre UART TX must be enabled (happens during init)
 *
 * @post Character written to TDR and transmission started
 * @post TDRE flag cleared (TDR occupied)
 *
 * @note Blocking call - waits for TDRE flag
 * @note Timeout prevents infinite wait if hardware fails
 * @warning May block for up to ~100ms if TX line is held low
 *
 * @par Thread Safety:
 * Thread-safe for different channels. Not safe for same channel without mutex.
 *
 * @par Performance:
 * - Execution time: ~90 us @ 115200 baud (one character time)
 * - Stack usage: 16 bytes
 *
 * @par Example:
 * @code{.c}
 * // Send single character
 * rx_err_t err = uart_putc_channel(k_uart_channel_9, 'A');
 * if (err != k_rx_ok) {
 *   // Handle error
 * }
 *
 * // Send carriage return + line feed
 * uart_putc_channel(k_uart_channel_9, '\r');
 * uart_putc_channel(k_uart_channel_9, '\n');
 * @endcode
 *
 * @see uart_puts_channel() Transmit string with newline conversion
 * @see uart_write_channel() Transmit binary data
 *
 * @since Version 1.0.0
 */
rx_err_t uart_putc_channel(const uart_channel_t channel, const char data)
{
  /* Validate channel */
  if ((uint8_t)channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  /* Check initialization */
  if (!s_channel_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  /* Get SCI register base */
  volatile rx_sci_regs_t* sci = sci_get_channel(channel);
  if (sci == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Wait for transmit buffer to be empty (TDRE flag) with timeout */
  uint32_t timeout = k_uart_tx_timeout;
  while ((sci->ssr & k_sci_ssr_tdre_flag) == k_uart_flag_clear &&
         timeout > k_uart_timeout_expired) {
    timeout -= k_uart_timeout_decrement;
  }

  /* Check if timeout occurred */
  if (timeout == k_uart_timeout_expired) {
    return k_rx_err_timeout;
  }

  /* Write data to transmit register */
  sci->tdr = (uint8_t)data;

  /* Clear TDRE flag by reading SSR then writing 0 */
  const uint8_t ssr = sci->ssr;
  sci->ssr          = (uint8_t)(ssr & ~k_sci_ssr_tdre_flag);

