Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
  /* Write each byte */
  for (uint16_t i = 0; i < length; i++) {
    const rx_err_t err = uart_putc_channel(channel, (char)data[i]);
    if (err != k_rx_ok) {
      return err;
    }
  }

  return k_rx_ok;
}

/**
 * @brief Receive single character from UART channel (non-blocking)
 *
 * @details
 * Attempts to read a single byte from the specified SCI channel's receive data
 * register (RDR). This is a **non-blocking** operation - returns immediately
 * with k_rx_err_empty if no data is available.
 *
 * **Algorithm steps:**
 * 1. Validate data pointer and channel number
 * 2. Check channel initialization state
 * 3. Get SCI register base address
 * 4. Clear any error flags (ORER, FER, PER)
 * 5. Check RDRF flag (Receive Data Register Full)
 *    - If not set, return k_rx_err_empty immediately
 * 6. Read data byte from RDR register
 * 7. Clear RDRF flag (read SSR, write back with RDRF=0)
 *
 * **Error flag handling:**
 * - ORER (Overrun Error): Previous data overwritten before read
 * - FER (Framing Error): Stop bit not detected
 * - PER (Parity Error): Parity mismatch (not used in 8N1 mode)
 *
 * @param[in] channel UART channel to use (0-12)
 *   - **Valid range**: 0 to 12 (SCI0 through SCI12)
 *
 * @param[out] data Pointer to store received character
 *   - **Valid range**: Non-nullptr to char
 *   - **On success**: Contains received byte (0x00-0xFF)
 *   - **On error**: Content undefined
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success, received character stored in *data
 * @retval k_rx_err_null_ptr data parameter is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel number
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_empty No data available (RDRF not set)
 *
 * @pre Channel must be initialized via uart_init_channel()
 * @pre data must point to valid memory for single char
 *
 * @post On success, *data contains received byte
 * @post RDRF flag cleared (ready for next byte)
 * @post Error flags cleared if any were set
 *
 * @note Non-blocking - returns immediately if no data
 * @note Clears error flags automatically before read
 * @note Single byte buffer - call frequently to avoid overrun
 *
 * @par Thread Safety:
 * Thread-safe for different channels. Not safe for same channel without mutex.
 *
 * @par Performance:
 * - Execution time: ~5 us (no wait)
 * - Stack usage: 16 bytes
 *
 * @par Example (Polling Loop):
 * @code{.c}
 * char c;
 * rx_err_t err;
 *
 * // Poll for incoming data
 * do {
 *   err = uart_getc_channel(k_uart_channel_9, &c);
 *   if (err == k_rx_ok) {
 *     process_character(c);
 *   }
 * } while (err == k_rx_ok);  // Continue while data available
 * @endcode
 *
 * @par Example (Timeout Loop):
 * @code{.c}
 * char c;
 * uint32_t timeout = 100000;
 *
 * while (timeout > 0) {
 *   rx_err_t err = uart_getc_channel(k_uart_channel_9, &c);
 *   if (err == k_rx_ok) {
 *     // Got data
 *     break;
 *   }
 *   timeout--;
 * }
 *
 * if (timeout == 0) {
 *   // No data received within timeout
 * }
 * @endcode
 *
 * @see uart_read_channel() Read multiple bytes
 * @see uart_rx_available() Check if data is available
 *
 * @since Version 1.0.0
 */
rx_err_t uart_getc_channel(const uart_channel_t channel, char* data)
{
  /* Validate parameters */
  if (data == nullptr) {
    return k_rx_err_null_ptr;
  }

  if ((uint8_t)channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  if (!s_channel_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  /* SCI9 reads pull from the RXI9-fed ring buffer so polled callers cannot
   * lose bytes that arrive between polls. Head/tail word accesses are atomic
   * on RX72N (aligned 16-bit loads/stores are single-cycle), so lock-free
   * SPSC is safe between the ISR producer and the task consumer. */
  if (channel == k_uart_channel_9) {
    if (s_sci9_rx_tail == s_sci9_rx_head) {
      return k_rx_err_empty;
    }
    *data          = (char)s_sci9_rx_ring[s_sci9_rx_tail];
    s_sci9_rx_tail = (uint16_t)((s_sci9_rx_tail + 1U) & k_sci9_rx_ring_mask);
    return k_rx_ok;
  }

  /* Get SCI register base */
  volatile rx_sci_regs_t* sci = sci_get_channel(channel);
  if (sci == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Clear any error flags first */
  if ((sci->ssr & k_sci_ssr_error_mask) != k_uart_flag_clear) {
    internal_clear_errors(sci);
  }

  /* Check if receive data is available (RDRF flag) */
  if ((sci->ssr & k_sci_ssr_rdrf_flag) == k_uart_flag_clear) {
    return k_rx_err_empty;
  }

  /* Read received data */
  *data = (char)sci->rdr;

  /* Clear RDRF flag by reading SSR then writing 0 */
  /* Some RX MCUs require explicit clear after reading RDR */
  const uint8_t ssr = sci->ssr;
  sci->ssr          = (uint8_t)(ssr & ~k_sci_ssr_rdrf_flag);

  return k_rx_ok;
}

/**
 * @brief Read available bytes from UART channel (non-blocking)
 *
 * @details
 * Reads up to `length` bytes from the specified SCI channel using
 * uart_getc_channel(). Stops immediately when no more data is available
 * (RDRF flag not set) rather than waiting. Actual bytes received is
 * reported via `bytes_read`.
 *
 * **Algorithm steps:**
 * 1. Validate data and bytes_read pointers (NULL check)
 * 2. Validate channel number and initialization state
 * 3. Set *bytes_read = 0
 * 4. For each slot in [0, length):
 *    a. Call uart_getc_channel(); if k_rx_err_empty, break (done)
 *    b. On other error, propagate immediately
 *    c. Store byte and increment *bytes_read
 * 5. Return k_rx_ok (even if zero bytes were read)
 *
 * @param[in]  channel    UART channel to read from (0-12)
 *   - **Valid range**: 0 to 12 (SCI0 through SCI12)
 *
 * @param[out] data       Pointer to buffer to store received bytes
 *   - **Valid range**: Non-nullptr pointing to at least `length` bytes
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @param[in]  length     Maximum number of bytes to read
 *   - **Valid range**: 0 to UINT16_MAX
 *
 * @param[out] bytes_read Pointer to store actual number of bytes read
 *   - **Valid range**: Non-nullptr to uint16_t
 *   - **On success**: Set to number of bytes actually received (0..length)
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success; *bytes_read contains actual count (may be 0)
 * @retval k_rx_err_null_ptr data or bytes_read is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel number
 * @retval k_rx_err_invalid_state Channel not initialized
 *
 * @pre Channel must be initialized via uart_init_channel()
 * @pre data must point to at least `length` bytes of writable memory
 *
 * @post *bytes_read set to actual number of bytes received
 * @post data[0..*bytes_read-1] contain the received bytes
 *
 * @note Non-blocking - returns immediately with whatever data is available
 * @note k_rx_ok with *bytes_read == 0 means no data was available
 *
 * @par Thread Safety:
 * Thread-safe for different channels. Not safe for same channel without mutex.
 *
 * @par Performance:
 * - Execution time: ~5 us per byte received + ~5 us when no data
 * - Stack usage: 24 bytes
 *
 * @par Example:
 * @code{.c}
 * uint8_t  buf[64];
 * uint16_t count = 0;
 * rx_err_t err   = uart_read_channel(k_uart_channel_9, buf, sizeof(buf), &count);
 * if (err == k_rx_ok && count > 0) {
 *   process_bytes(buf, count);
 * }
 * @endcode
 *
 * @see uart_getc_channel() Read single character
 * @see uart_rx_available() Check if data is available
 * @see uart_write_channel() Write binary data
 *
 * @since Version 1.0.0
 */
rx_err_t uart_read_channel(const uart_channel_t channel,
                           uint8_t*             data,
                           uint16_t             length,
                           uint16_t*            bytes_read)
{
  /* Validate parameters */
  if (data == nullptr || bytes_read == nullptr) {
    return k_rx_err_null_ptr;
  }

  if ((uint8_t)channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  if (!s_channel_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

